<ol>
<li>Get the dataset</li>
<li>Importing the libraries</li>
<li>Importing the dataset</li>
<li>Missing Data</li>
<li>Categorical data</li>
<li>Splitting data into train/test</li>
<li>feature scaling</li>
</ol>

In [1]:
# 1) Get the dataset :getting the data from it's source (ETL tools) and determine DV & ID

In [2]:
# 2) Importing the libraries (essential libraries )
import numpy as np # mathiatical purpose
import pandas as pd # import & manage the data
import matplotlib.pyplot as plt # visualization purpose

In [3]:
# 3) Importing the dataset
dataset = pd.read_csv('data/Data.csv')
dataset.head(2)

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No
1   Spain  27.0  48000.0       Yes

In [4]:
# Independent Variable (IV)  
IV = dataset.iloc[:,:-1]
IV.head(2)

  Country   Age   Salary
0  France  44.0  72000.0
1   Spain  27.0  48000.0

In [5]:
# dependent Variable (DV)
DV = dataset.iloc[:,-1:]
DV.head(2)

  Purchased
0        No
1       Yes

In [6]:
# 4) Missing Data: use mean for missing the missing data in this case
IV['Age'].fillna(int(IV['Age'].mean()),inplace=True)
IV['Salary'].fillna(int(IV['Salary'].mean()),inplace=True)
IV

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0  63777.0
5   France  35.0  58000.0
6    Spain  38.0  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [7]:
# 5) Categorical Variables
# Label encoding : First convert variables type into categorical
IV['Country'] = IV['Country'].astype('category')
IV['Country'] = IV['Country'].cat.codes
IV.head(5)

   Country   Age   Salary
0        0  44.0  72000.0
1        2  27.0  48000.0
2        1  30.0  54000.0
3        2  38.0  61000.0
4        1  40.0  63777.0

In [8]:
# one hot encoding
pd.get_dummies(IV['Country'])
pd.get_dummies(DV['Purchased']).head(5)

   No  Yes
0   1    0
1   0    1
2   1    0
3   1    0
4   0    1

In [9]:
# 6) split the data into train/test sets
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(IV,DV,test_size=.2,random_state=0)

In [10]:
# 7) feature scaling : because most of machine learning models based on the euclidean distance between the points 
#  (Salary)/(Age) : (Y2-Y1)^2/(X2/X1)^2 so the model will be dominated by the salary becase the range is very large comparing to the age
# salary (100000-70000)^2 =  900000000
# Age (65-45)^2 = 400 
# Age (55-40)^2 =215

In [11]:
# feature scaling types
# 1) standardization: depends on mean & standard deviation
# 2) Normalization : depends on min & max values
# ------------
# feature scaling for dummies : depend on the problems, we can say most of the time yes
# -------------
# feature scaling for Dependent variables : if classification will be (no) / for regression and DV in huge range will be (yes)

In [12]:
from sklearn.preprocessing import StandardScaler
SS = StandardScaler()
SS.fit_transform(x_train)
SS.fit_transform(x_test)

array([[ 0., -1., -1.],
       [ 0.,  1.,  1.]])

In [13]:
from sklearn.preprocessing import Normalizer
NS = Normalizer()
NS.fit_transform(x_train)
NS.fit_transform(x_test)

array([[1.85185157e-05, 5.55555470e-04, 9.99999846e-01],
       [1.20481906e-05, 6.02409529e-04, 9.99999818e-01]])

## Done